# St7SetVertexTemperature1

Assigns a temperature to the specified vertex.

long St7SetVertexTemperature1(long uID, long VertexNum, long CaseNum,

double* Doubles)

Input Parameters

uID

Strand7 model file ID.

VertexNum

Vertex number.

CaseNum

Load case number.

Doubles[0]

 Temperature value at the specified vertex.

Strand7 API Manual